scc2425-tukano/src/main/test/scc2425-artillery-tests/upload_shorts_out.txt
Test run id: tmd7k_nz7kjtkwbh3g4y9dmy3q88yq969hb_dqtq
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 18:51:13(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 18:51:23(+0000)

--------------------------------------
Metrics for period to: 18:51:20(+0000) (width: 5.102s)
--------------------------------------

http.codes.200: ................................................................ 9
http.codes.204: ................................................................ 9
http.downloaded_bytes: ......................................................... 3197
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 21
http.response_time:
  min: ......................................................................... 146
  max: ......................................................................... 3028
  mean: ........................................................................ 728.2
  median: ...................................................................... 450.4
  p95: ......................................................................... 1939.5
  p99: ......................................................................... 1939.5
http.response_time.2xx:
  min: ......................................................................... 146
  max: ......................................................................... 3028
  mean: ........................................................................ 728.2
  median: ...................................................................... 450.4
  p95: ......................................................................... 1939.5
  p99: ......................................................................... 1939.5
http.responses: ................................................................ 18
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 9
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  9
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 146
  max: ......................................................................... 673
  mean: ........................................................................ 361.4
  median: ...................................................................... 383.8
  p95: ......................................................................... 572.6
  p99: ......................................................................... 572.6
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 446
  max: ......................................................................... 3028
  mean: ........................................................................ 1094.9
  median: ...................................................................... 727.9
  p95: ......................................................................... 1939.5
  p99: ......................................................................... 1939.5
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 12
vusers.created_by_name.Upload short: ........................................... 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 630.4
  max: ......................................................................... 3628
  mean: ........................................................................ 1473.2
  median: ...................................................................... 871.5
  p95: ......................................................................... 2618.1
  p99: ......................................................................... 2618.1


--------------------------------------
Metrics for period to: 18:51:30(+0000) (width: 4.642s)
--------------------------------------

http.codes.200: ................................................................ 21
http.codes.204: ................................................................ 21
http.downloaded_bytes: ......................................................... 7312
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 39
http.response_time:
  min: ......................................................................... 121
  max: ......................................................................... 678
  mean: ........................................................................ 313.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 450.4
  p99: ......................................................................... 459.5
http.response_time.2xx:
  min: ......................................................................... 121
  max: ......................................................................... 678
  mean: ........................................................................ 313.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 450.4
  p99: ......................................................................... 459.5
http.responses: ................................................................ 42
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 21
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  21
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 121
  max: ......................................................................... 240
  mean: ........................................................................ 178.6
  median: ...................................................................... 179.5
  p95: ......................................................................... 198.4
  p99: ......................................................................... 198.4
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 410
  max: ......................................................................... 678
  mean: ........................................................................ 448.2
  median: ...................................................................... 441.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 459.5
vusers.completed: .............................................................. 21
vusers.created: ................................................................ 18
vusers.created_by_name.Upload short: ........................................... 18
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 546.5
  max: ......................................................................... 881
  mean: ........................................................................ 640
  median: ...................................................................... 632.8
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5


All VUs finished. Total time: 11 seconds

--------------------------------
Summary report @ 18:51:26(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 10509
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 121
  max: ......................................................................... 3028
  mean: ........................................................................ 437.8
  median: ...................................................................... 424.2
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1939.5
http.response_time.2xx:
  min: ......................................................................... 121
  max: ......................................................................... 3028
  mean: ........................................................................ 437.8
  median: ...................................................................... 424.2
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1939.5
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 30
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  30
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 121
  max: ......................................................................... 673
  mean: ........................................................................ 233.4
  median: ...................................................................... 183.1
  p95: ......................................................................... 528.6
  p99: ......................................................................... 572.6
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 410
  max: ......................................................................... 3028
  mean: ........................................................................ 642.2
  median: ...................................................................... 441.5
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1939.5
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 546.5
  max: ......................................................................... 3628
  mean: ........................................................................ 889.9
  median: ...................................................................... 632.8
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 2618.1